# RoomComputationMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RoomComputationMethod Property
ParameterTypeId Class See Also
---
"Computation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RoomComputationMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RoomComputationMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RoomComputationMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace